<?php
//1. С помощью цикла while вывести все числа в промежутке от 0 до 100, которые делятся на 3 без остатка.
$i=0;
while($i <= 100) {
    if($i % 3 == 0) {
        echo $i." ";
    }
    $i++;
}

// С помощью цикла do…while написать функцию для вывода чисел от 0 до 10, чтобы результат выглядел так:
$n = 0;
function num ($n) {
    do {
        if($n == 0) {
            echo $n." - ноль ";
            $n++;
        }
        if($n % 2 == 0) {
            echo $n." - четное число ";
        }else {
            echo $n." - нечетное число ";
        }
        $n++;
    }
    while($n<=10);
}
num($n);

//Объявить массив, в котором в качестве ключей будут использоваться названия областей, а в качестве значений – массивы с названиями городов из соответствующей области. Вывести в цикле значения массива, чтобы результат был таким:

$cities = ["Московская область"=> ["Москва", "Зеленоград", "Клин"],
"Ленинградская область"=> ["Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"],
"Рязанская область" => ["Рязань", "Ксимов", "Кораблино"]
];

foreach($cities as $region => $city) {
    echo "$region: "; 
    foreach ($city as $value) {
        echo "$value, ";
    } 
    echo "<br>";
}

//Объявить массив, индексами которого являются буквы русского языка, а значениями – соответствующие латинские буквосочетания (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’).
function rusTranslit($string) {
    $converter = [
        'а' => 'a',   'б' => 'b',   'в' => 'v',
        'г' => 'g',   'д' => 'd',   'е' => 'e',
        'ё' => 'e',   'ж' => 'zh',  'з' => 'z',
        'и' => 'i',   'й' => 'y',   'к' => 'k',
        'л' => 'l',   'м' => 'm',   'н' => 'n',
        'о' => 'o',   'п' => 'p',   'р' => 'r',
        'с' => 's',   'т' => 't',   'у' => 'u',
        'ф' => 'f',   'х' => 'h',   'ц' => 'c',
        'ч' => 'ch',  'ш' => 'sh',  'щ' => 'sch',
        'ь' => '\'',  'ы' => 'y',   'ъ' => '\'',
        'э' => 'e',   'ю' => 'yu',  'я' => 'ya',
        
        'А' => 'A',   'Б' => 'B',   'В' => 'V',
        'Г' => 'G',   'Д' => 'D',   'Е' => 'E',
        'Ё' => 'E',   'Ж' => 'Zh',  'З' => 'Z',
        'И' => 'I',   'Й' => 'Y',   'К' => 'K',
        'Л' => 'L',   'М' => 'M',   'Н' => 'N',
        'О' => 'O',   'П' => 'P',   'Р' => 'R',
        'С' => 'S',   'Т' => 'T',   'У' => 'U',
        'Ф' => 'F',   'Х' => 'H',   'Ц' => 'C',
        'Ч' => 'Ch',  'Ш' => 'Sh',  'Щ' => 'Sch',
        'Ь' => '\'',  'Ы' => 'Y',   'Ъ' => '\'',
        'Э' => 'E',   'Ю' => 'Yu',  'Я' => 'Ya',
    ];
    return strtr($string, $converter);
}

echo(rusTranslit("Моника"));


//Написать функцию, которая заменяет в строке пробелы на подчеркивания и возвращает видоизмененную строчку.

function replace ($string) {
    $phrase2 = str_replace(" ", "-", $string);
    echo $phrase2;
}
    echo(replace("Some text. Mb some more text"));
    

//Вывести с помощью цикла for числа от 0 до 9, НЕ используя тело цикла. То есть выглядеть должно так:
   // for($i=0; $i<=9; print($i++)){};

//Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К».


$cities = ["Московская область"=> ["Москва", "Зеленоград", "Клин"],
"Ленинградская область"=> ["Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"],
"Рязанская область" => ["Рязань", "Ксимов", "Кораблино"]
];

foreach($cities as $region => $city) {
    echo "$region: "; 
    foreach ($city as $value) {
        if(mb_substr($value, 0, 1) == "К") {
            echo "$value, ";
        }
    } 
    echo "<br>";
}

//*Объединить две ранее написанные функции в одну, которая получает строку на русском языке, производит транслитерацию и замену пробелов на подчеркивания (аналогичная задача решается при конструировании url-адресов на основе названия статьи в блогах).

function rusTranslit($string) {
    $converter = [
        'а' => 'a',   'б' => 'b',   'в' => 'v',
        'г' => 'g',   'д' => 'd',   'е' => 'e',
        'ё' => 'e',   'ж' => 'zh',  'з' => 'z',
        'и' => 'i',   'й' => 'y',   'к' => 'k',
        'л' => 'l',   'м' => 'm',   'н' => 'n',
        'о' => 'o',   'п' => 'p',   'р' => 'r',
        'с' => 's',   'т' => 't',   'у' => 'u',
        'ф' => 'f',   'х' => 'h',   'ц' => 'c',
        'ч' => 'ch',  'ш' => 'sh',  'щ' => 'sch',
        'ь' => '\'',  'ы' => 'y',   'ъ' => '\'',
        'э' => 'e',   'ю' => 'yu',  'я' => 'ya',
        
        'А' => 'A',   'Б' => 'B',   'В' => 'V',
        'Г' => 'G',   'Д' => 'D',   'Е' => 'E',
        'Ё' => 'E',   'Ж' => 'Zh',  'З' => 'Z',
        'И' => 'I',   'Й' => 'Y',   'К' => 'K',
        'Л' => 'L',   'М' => 'M',   'Н' => 'N',
        'О' => 'O',   'П' => 'P',   'Р' => 'R',
        'С' => 'S',   'Т' => 'T',   'У' => 'U',
        'Ф' => 'F',   'Х' => 'H',   'Ц' => 'C',
        'Ч' => 'Ch',  'Ш' => 'Sh',  'Щ' => 'Sch',
        'Ь' => '\'',  'Ы' => 'Y',   'Ъ' => '\'',
        'Э' => 'E',   'Ю' => 'Yu',  'Я' => 'Ya',
    ];

    return strtr($string, $converter);
}

function replace ($string) {
    $string = str_replace(" ", "-", $string);
    $string = rusTranslit($string);
    return $string;
}

echo(replace("Some text. Mb some more text"));